** Tips en général

+ La variable ~custom-theme-directory~ indique l'emplacement du dossier perso où doom va chercher des fichier .el contenant des thèmes. Ils apparaissent dans la liste de ~load-theme~
+ La fonction ~yas-describe-tables~ montre une liste des snippets disponibles pour le mode actuel
    #+BEGIN_SRC emacs-lisp
      (yas-describe-tables)
    #+END_SRC

    #+RESULTS:
    : #<window 27 on *YASnippet Tables*>
+ Lorsque l'environnement python est changé par pyenv-mode-set, il faut reload lsp avec lsp-workspace-restart (personnal command: switch-venv fait les deux en même temps)
+ Après avoir switché de branche, utiliser ~vc-refresh-state~ pour mettre à jour le version contrôle de la bar
+ Pour vérifier la configuration de flycheck: ~flycheck-verify-setup~ On peut aussi rapidement changer de checker avec ~flycheck-select-checker~
+ Le directory editor actuel est ranger.el : https://github.com/ralesi/ranger.el
+ [[https://github.com/emacsmirror/bluetooth][Bluetooth manager]]

